---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.#ctor
source: html/9ae90741-c7ca-d95a-24fc-f3573d75c9d5.htm
---
# Autodesk.Revit.DB.ConnectorSet.#ctor Method

Initializes a new instance of the ConnectorSet class

## Syntax (C#)
```csharp
public ConnectorSet()
```